code/xyedu/frontend/controllers/PostController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT * FROM `post` WHERE `id`='45'

    protected function findModel($id)
    {
        if (($model = Post::findOne($id)) !== null) {
---
SELECT EXISTS(SELECT * FROM `post` WHERE `post`.`id`='45')