backend/controllers/PostController.php

SELECT * FROM `post` WHERE `id`='45'
---
    protected function findModel($id)
    {
        if (($model = Post::findOne($id)) !== null) {