frontend/controllers/PostController.php

SELECT * FROM `post` WHERE `id`='42'
---
    protected function findModel($id)
    {
        if (($model = Post::findOne($id)) !== null) {

SELECT * FROM `user` WHERE `id` IS NULL
---
    public function actionDetail($id)
    {
        //step1. 准备数据模型
        $model = $this->findModel($id);
        $tags=Tag::findTagWeights();
        $recentComments=Comment::findRecentComments();

        if (isset(Yii::$app->user->id)){
            $userMe = User::findOne(Yii::$app->user->id);