backend/views/post/_form.php

SELECT `name`, `id` FROM `category`
---

    <?= $form->field($model, 'title')->textInput(['maxlength' => true]) ?>

    <?= $form->field($model,'category_id')
        ->dropDownList(\common\models\Category::find()
            ->select(['name','id'])
            ->indexBy('id')
            ->column(),['prompt'=>'请选择分类']
        )

SELECT `name`, `id` FROM `poststatus` ORDER BY `position`
---
//    $psObj = Poststatus::find()->all();
//    $allStatus = \yii\helpers\ArrayHelper::map($psObj,'id','name');
//方法二
    $allStatus =(new \yii\db\Query())
        ->select(['name','id'])
        ->from('poststatus')
        ->orderBy('position')
        ->indexBy('id')
        ->column();

SELECT `nickname`, `id` FROM `adminuser`
---
    <?= $form->field($model,'status')
        ->dropDownList($allStatus,['prompt'=>'请选择状态']) ?>

     <?= $form->field($model,'author_id')
        ->dropDownList(\common\models\Adminuser::find()
        ->select(['nickname','id'])
        ->indexBy('id')
        ->column(),['prompt'=>'请选择作者']
        )