backend/views/post/index.php

//            'content:ntext',
            'tags:ntext',
//            'status',
        ['attribute'=>'status',
        'value'=>'status0.name',
            'filter'=>Poststatus::find()
                    ->select(['name','id'])
                    ->orderby('position')
                    ->indexby('id')
                    ->column(),
            ],
---
SELECT `name`, `id` FROM `poststatus` ORDER BY `position`