code/xyedu/backend/views/post/_form.php

//    $psObj = Poststatus::find()->all();
//    $allStatus = \yii\helpers\ArrayHelper::map($psObj,'id','name');
//方法二
    $allStatus =(new \yii\db\Query())
        ->select(['name','id'])
        ->from('poststatus')
        ->orderBy('position')
        ->indexBy('id')
        ->column();
---
SELECT `name`, `id` FROM `poststatus` ORDER BY `position`

    <?= $form->field($model,'status')
        ->dropDownList($allStatus,['prompt'=>'请选择状态']) ?>

     <?= $form->field($model,'author_id')
        ->dropDownList(\common\models\Adminuser::find()
        ->select(['nickname','id'])
        ->indexBy('id')
        ->column(),['prompt'=>'请选择作者']
        )
---
SELECT `nickname`, `id` FROM `adminuser`