code/xyedu/backend/views/post/index.php

SELECT `name`, `id` FROM `category`
---
        'value'=>'author.nickname'],
            ['attribute'=>'category_id',
                'value'=>'category.name',
                'filter'=>\common\models\Category::find()
                    ->select(['name','id'])
                    ->indexby('id')
                    ->column(),

SELECT `name`, `id` FROM `poststatus` ORDER BY `position`
---
//            'content:ntext',
            'tags:ntext',
//            'status',
        ['attribute'=>'status',
        'value'=>'status0.name',
            'filter'=>Poststatus::find()
                    ->select(['name','id'])
                    ->orderby('position')
                    ->indexby('id')
                    ->column(),
            ],