frontend/views/post/detail.php

                        echo $data;
                        */
                        ?>
                        <?= Post::find()->count();?>
---
SELECT COUNT(*) FROM `post`