frontend/views/post/index.php

SELECT COUNT(*) FROM `post`
---
                        echo $data;
                        */
                        ?>
                        <?= Post::find()->count();?>