code/xyedu/backend/views/comment/index.php

//            'status',
            ['attribute'=>'status',
                'value'=>'status0.name',
                'filter'=>Commentstatus::find()
                    ->select(['name','id'])
                    ->orderBy('position')
                    ->indexBy('id')
                    ->column(),
---
SELECT `name`, `id` FROM `commentstatus` ORDER BY `position`