code/xyedu/common/models/Comment.php

    public function approve()
    {
        $this->status = 2;  //设置为已审核状态
        return ($this->save()?true:false);
---
UPDATE `comment` SET `status`=2 WHERE `id`=101

    public static function getPengDingCommentCount()
    {
        return Comment::find()->where(['status' => 1])->count();
---
SELECT COUNT(*) FROM `comment` WHERE `status`=1

    public static function findRecentComments($limit=10)
    {
        return Comment::find()->where(['status'=>2])->orderBy('create_time DESC')
            ->limit($limit)->all();
---
SELECT * FROM `comment` WHERE `status`=2 ORDER BY `create_time` DESC LIMIT 10