code/xyedu/common/models/Tag.php

    public static function findTagWeights($limit=20)
    {
        $tag_size_level = 5;

        $models=Tag::find()->orderBy('frequency desc')->limit($limit)->all();
        $total=Tag::find()->limit($limit)->count();
---
SELECT * FROM `tag` ORDER BY `frequency` DESC LIMIT 20
SELECT COUNT(*) FROM `tag`