code/xyedu/backend/controllers/CommentController.php

SELECT * FROM `comment` WHERE `id`='101'
---
    protected function findModel($id)
    {
        if (($model = Comment::findOne($id)) !== null) {